import ContentMarkdown from "@/components/ui/content-markdown";

export const metadata = {
  title: 'Защита персональных данных - АНПОО "АВТОШКОЛА ПЛЮС"',
  description:
    'Ознакомьтесь с нашей политикой конфиденциальности. АНПОО "АВТОШКОЛА ПЛЮС" строго соблюдает правила защиты персональных данных клиентов.',
};

const pdConsent = `
Я согласен(на) на обработку моих персональных данных
Настоящим Я, действуя своей волей и в своем интересе, при размещении (вводе) своих персональных данных на Интернет сайте <a href="https://autoschoolplus.ru">autoschoolplus.ru</a> Автономной некоммерческой профессиональной образовательной организации "Автошкола плюс" (ИНН 1324002715, ОГРН 1181326004969, далее - Оператор) подтверждаю свое согласие на обработку указанных мной персональных данных Оператором в целях предложения мне услуг, новых услуг, предлагаемых Оператором, в целях проведения опросов, анкетирования, рекламных и маркетинговых исследований в отношении услуг, предоставляемых Оператором, в том числе путем осуществления прямых контактов со мною посредством средств связи, указанных мной на настоящем сайте.Настоящее право (согласие) предоставляется на осуществление любых действий в отношении моих персональных данных, которые необходимы и желаемы для достижения вышеуказанных целей, включая, без ограничения, сбор, систематизацию, накопление, хранение, уточнение (обновление, изменение), использование, передачу, обезличивание, блокирование и уничтожение персональных данных, под которыми понимаются все данные, указанные мной на настоящем сайте.

Настоящим подтверждаю, что уведомлен о том, что обработка персональных данных осуществляется Оператором любым способом, в том числе как с использованием средств автоматизации (включая программное обеспечение), так и без использования средств автоматизации (с использованием различных материальных носителей, включая бумажные носители).
`;

export default function PdConsent() {
  return (
    <div className="relative bg-white pt-36 pb-24 sm:pt-44 sm:pb-32">
      <div className="mx-auto max-w-7xl px-6 lg:px-8">
        <div className=" overflow-hidden flex justify-between items-start">
          <h2 className="text-3xl font-bold max-w-2xl lg:text-4xl">
            Согласие на обработку{" "}
            <span className="text-accent">персональных данных</span> ООО Партнер
          </h2>
        </div>
        <ContentMarkdown className="mt-4" content={pdConsent} />
      </div>
    </div>
  );
}
